{
  "backend/main.mo": "Empty Motoko actor placeholder for backend logic.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to files, components, and test identifiers.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files for quick reference.",
  "frontend/index.css": "Global Tailwind and OKLCH variable definitions with dark theme styling and base layout rules.",
  "frontend/index.html": "HTML entry point containing the root div and script loader for the React app.",
  "frontend/src/App.tsx": "Renders the LandingPage component as the main application view.",
  "frontend/src/components/landing/effects/HeroBackground.tsx": "Generates animated gradient and floating particle effects behind the hero section.",
  "frontend/src/components/landing/LandingPage.tsx": "Composes all landing page sections with refs for scroll reveal animations and smooth scrolling.",
  "frontend/src/components/landing/sections/FeaturesSection.tsx": "Displays a grid of product features with icons and descriptive text.",
  "frontend/src/components/landing/sections/FinalCTASection.tsx": "Final call‑to‑action section with headline, description, and glow‑accented CTA button.",
  "frontend/src/components/landing/sections/Footer.tsx": "Footer with copyright, attribution link, and social media icons.",
  "frontend/src/components/landing/sections/HeroSection.tsx": "Hero banner with animated background, headline, subheadline, and CTA buttons.",
  "frontend/src/components/landing/sections/HowItWorksSection.tsx": "Three‑step explanation of how the product works using icon cards.",
  "frontend/src/components/landing/sections/index.ts": "Re-exports all landing page section components for simplified imports.",
  "frontend/src/components/landing/sections/PricingSection.tsx": "Renders a pricing section with three tier configurations and maps them into PricingCard components.",
  "frontend/src/components/landing/sections/ProblemSection.tsx": "Displays a section highlighting common barriers to launching products using styled cards and icons.",
  "frontend/src/components/landing/ui/DividerGlow.tsx": "Provides a simple horizontal glowing divider element.",
  "frontend/src/components/landing/ui/FeatureGrid.tsx": "Maps a list of feature objects into a responsive grid of GlassCard items with icons and descriptions.",
  "frontend/src/components/landing/ui/GlassCard.tsx": "A reusable glass-style card component with optional hover glow behavior.",
  "frontend/src/components/landing/ui/GlowButton.tsx": "Extends a Button with glow effects and styling variants using forwardRef.",
  "frontend/src/components/landing/ui/IconBadge.tsx": "Displays an icon inside a glowing glass-style badge container.",
  "frontend/src/components/landing/ui/PricingCard.tsx": "Renders an individual pricing tier card with features, pricing, and a call-to-action button.",
  "frontend/src/components/landing/ui/Section.tsx": "Wraps children in a styled container section with layout utilities.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements context and logic for managing Internet Identity authentication and state.",
  "frontend/src/hooks/useScrollReveal.ts": "Adds scroll-reveal animation behavior to referenced DOM elements via IntersectionObserver.",
  "frontend/src/index.css": "Defines Tailwind base styles, custom theme variables, glass effects, glow utilities, and animations.",
  "frontend/src/lib/utils.ts": "Provides a utility function to merge and normalize class names.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, radii, shadows, fonts, and animation keyframes, plus plugins for typography, container queries, and animations.",
  "project_state.json": "JSON metadata describing the project’s state, goals, design requirements, and feature list for building the IDEAZS landing page."
}